RhinoInside.Revit API Documentation
GeometryDecoder.ToPlane Method
 Converts the specified Autodesk.Revit.DB.Plane to an equivalent Rhino.Geometry.Plane.
 Namespace: RhinoInside.Revit.Convert.Geometry
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.5.8027
Syntax
public static Rhino.Geometry.Plane ToPlane(
	this Autodesk.Revit.DB.Plane plane
)
@staticmethod
def ToPlane(
	plane: Autodesk.Revit.DB.Plane
) -> Rhino.Geometry.Plane
Parameters
plane
Type: Autodesk.Revit.DB.Plane
Revit point to convert.
Return Value
Type: Rhino.Geometry.Plane
Rhino plane that is equivalent to the provided Revit plane.
Usage Note
In Visual Basic and C#, you can call this method as an instance method on any object of type Autodesk.Revit.DB.Plane. When you use instance method syntax to call this method, omit the first parameter. For more information, see Extension Methods (Visual Basic) or Extension Methods (C# Programming Guide).
Examples
 Using ToPlane(Plane) as extension method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Plane rhinoPlane = revitPlane.ToPlane();
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry
clr.ImportExtensions(RhinoInside.Revit.Convert.Geometry)
rhino_plane = revit_plane.ToPlane() # type: RG.Plane
 Using ToPlane(Plane) as static method:
using DB = Autodesk.Revit.DB;
using RhinoInside.Revit.Convert.Geometry;
Plane rhinoPlane = GeometryEncoder.ToPlane(revitPlane)
import clr
clr.AddReference("RhinoCommon")
clr.AddReference("RevitAPI")
clr.AddReference("RhinoInside.Revit")
import Rhino.Geometry as RG
import Autodesk.Revit.DB as DB
import RhinoInside.Revit.Convert.Geometry.GeometryDecoder as GD
rhino_plane = GD.ToPlane(revit_plane) # type: RG.Plane
See Also
Reference
GeometryDecoder Class
RhinoInside.Revit.Convert.Geometry Namespace